[
    {
        "role":"Software Engineer",
        "company":"[Quavlive](https://quavlive.com)",
        "summary":"Quavlive conducts industrial research activities aimed at the design and development of new and innovative video streaming techniques and services for the web including On-Demand, Live streaming, and video-conferencing. Here are some of my main contributions as a front-end developer and more:\n- Had a leading role in the transitioning of the [QuavStreams](https://quavstreams.quavlive.com) video portal to the Angular development framework \n- Re-designed the company’s [website](https://quavlive.com) from scratch \n- Was responsible for anything related to iOS/macOS in our video solutions\n- Was heavily involved in the writing of two relevant European project proposals \n- Made several improvements to the WebRTC-based video conferencing system (client-side)",
        "range":"July 2018 - Present",
        "knowledge":""
    },
    {
        "role":"Researcher",
        "company":"[Politecnico di Bari](http://www.poliba.it)",
        "summary":"After winning a Post-Lauream scholarship, I joined a project called 'CLIPS - a Cloud based pLatform for Immersive adaPtive video Streaming', aimed at creating an innovative platform for distributing immersive video content (360°) in the web. Here are some of the main activities I was involved in:\n- Co-authored a [paper](#Publications) showcasing an innovative 360-degree video streaming approach involving video rescaling and multi-view automatic video switching\n- Defined a custom encoding format for panoramic videos, and a presentation format for the video content (in compliance with MPEG-DASH, and HLS standards)\n- Implemented the aforementioned 360-degree video platform (in particular the Encoder and the Player)\n- Extended the Google video streaming framework [ShakaPlayer](https://github.com/google/shaka-player) (that is used inside the Player) to introduce arbitrary buffer depletion \n- Attended the international ACM Multimedia Systems Conference 2018 (MMSYS) in Amsterdam, where we presented a Demo of the immersive platform",
        "range":"November 2017 - June 2018"
    },
    {
        "role":"Research Intern",
        "company":"[I3S / CNRS](https://www.linkedin.com/company/i3s-cnrs/)",
        "summary":"During the course of the internship I did during my stay in France, I worked for 6 months on a research project aimed at the study of the Quality of Experience perceived by users when watching streamed VR/360 content. The project also involved working within a team of 3 developers to build an end-to-end platform for streaming 360° videos with heterogeneous quality. Here's my contribution summarized: \n- Co-authored a [paper](#Publications) presenting a study on the QoE in VR video streaming which gained a money prize from the [DASH Industry Forum](https://dashif.org/academic/) at MMSYS ‘18\n- Helped building the underlining [VR video streaming app](https://github.com/UCA4SVR/TOUCAN-VR) for Android \n- Tweaked the Google video streaming framework ExoPlayer to enable parallel streaming of separate video tracks, and implemented the adaptation logic and buffering strategy",
        "range":"March 2017 - August 2017"
    }
]
